cf/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СоставКонтактнойИнформации</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Грузополучатели</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СоставКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыгружатьВБухгалтерию</Name>
					<Comment>признак синхронизации с бухгалтерией</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКИ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыВидовКИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СоставКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереводСтроки</Name>
							<Comment>При формировании представлении если перед этим полем будет текст тогда будет нажат ентер для перевода строки на следующую строку</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/ChartsOfCharacteristicTypes/СоставКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>СоставКонтактнойИнформации</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Города</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияХарактерстикКонтактнойИнформации</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
				<v8:Type>cfg:CatalogRef.Страны</v8:Type>
				<v8:Type>cfg:CatalogRef.Улицы</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>20</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>100</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СоставКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОграничениеПоСтрокам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Строка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

cf/CommonForms/ФормаКонтактнойИнформации/Ext/Form/Module.bsl
// СТАРОЕ НОВОЕ

&НаСервере
Функция ДобавитьПолеФормы(Имя, Группа = Неопределено, Заголовок = Неопределено, ОбработчикПриИзменении = "", ОбработчикНачалоВыбора = "", ЦветФона = Неопределено, ЦветФонаЗаголовка = Неопределено)
	                      // уникальное имя     тип      родитель       
	НовоеПоле = Элементы.Добавить("Поле" + Имя, Тип("ПолеФормы"), Группа);	
	НовоеПоле.ПутьКДанным = Имя;
	НовоеПоле.Заголовок = ?(ЗначениеЗаполнено(Заголовок), Заголовок, Имя);
	НовоеПоле.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
	НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
	
	Если ЦветФонаЗаголовка <> Неопределено Тогда
		НовоеПоле.ЦветФонаЗаголовка = ЦветФонаЗаголовка;
	КонецЕсли;
	
	Если ЦветФона <> Неопределено Тогда
		НовоеПоле.ЦветФона = ЦветФона;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ОбработчикПриИзменении) Тогда
		НовоеПоле.УстановитьДействие("ПриИзменении", ОбработчикПриИзменении);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбработчикНачалоВыбора) Тогда
		НовоеПоле.УстановитьДействие("НачалоВыбора", ОбработчикНачалоВыбора);
	КонецЕсли;
	
	Возврат НовоеПоле;
	
КонецФункции
&НаСервере
Функция ПолучитьРезультатЗаполнения()
	
	НовоеПредставление = "";
	
	Для Каждого Строка Из ЗначенияПолей Цикл
		Реквизит = ЭтаФорма["Реквизит" + ЗначенияПолей.Индекс(Строка)];
        Если ЗначениеЗаполнено(Реквизит) Тогда
			
			Строка.Значение = Реквизит;
			НовоеПредставление	= НовоеПредставление + ", "  + Строка.Поле.Сокращение + Реквизит;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат СокрЛП(Сред(НовоеПредставление, 2));
	
КонецФункции
&НаСервере
Процедура СформироватьЗаполнитьФорму();
		
			
		НовыеРеквизиты = Новый Массив;
			
		СоответствияИмен	 = Новый Соответствие;
		СоответствияЗначений = Новый Соответствие;
			
		Для Каждого Строка Из ЗначенияПолей Цикл
				
			Имя 		= "Реквизит" + ЗначенияПолей.Индекс(Строка);
			Заголовок 	= Строка.Поле.Наименование;
			Значение	= Строка.Значение;
			Тип         = Строка.Поле.ТипЗначения;
				
			НовыйРеквизит = Новый РеквизитФормы(Имя, Тип, , Заголовок, Истина);
			НовыеРеквизиты.Добавить(НовыйРеквизит);
				                                         
			СоответствияИмен.Вставить(Имя, Заголовок);  
			СоответствияЗначений.Вставить(Имя, Значение);   
				
		КонецЦикла;
			
		// добавляем новые реквизиты формы
		ИзменитьРеквизиты(НовыеРеквизиты);
			
		// заполняем значения реквизитов формы
		Для Каждого Элемент Из СоответствияЗначений Цикл
			ЭтаФорма[Элемент.Ключ] = Элемент.Значение; 	
		КонецЦикла;
			
		// добавлем новые элементы формы
		Для Каждого Элемент Из СоответствияИмен Цикл
			ДобавитьПолеФормы(Элемент.Ключ, , Элемент.Значение);
		КонецЦикла;
			
		ДобавитьПолеФормы("ПолноеПредставление", , "Представление");
		
КонецПроцедуры

// НОВОЕ РАБОТАЮЩЕЕ

&НаСервере
Функция	СформироватьПредставление()
	
	Если Группа = Справочники.ВидыКонтактнойИнформации.Телефон Тогда
		
		Возврат СформироватьПредставлениеТелефон();
	КонецЕсли;
	
	Возврат УправлениеКонтактнойИнформацией.ПолучитьСтроковоеПредставлениеАдреса(ЗначенияПолей);
	
КонецФункции

&НаСервере
Функция ЗначениеПоПолю(Поле)
	
	Строки = ЗначенияПолей.НайтиСтроки(Новый Структура("Поле", ПланыВидовХарактеристик.СоставКонтактнойИнформации[Поле]));
	
	Если Строки.Количество() Тогда
		ЗначениеПоля = Строка(Строки[0].Значение);
		Возврат ?(ПустаяСтрока(ЗначениеПоля), "", Строки[0].Сокращение +ЗначениеПоля);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция	СформироватьПредставлениеТелефон();
	
	НовоеПредставление = "";
	
	КодСтраны	= ЗначениеПоПолю("КодСтраны");
	КодГорода 	= ЗначениеПоПолю("КодГорода");
	Добавочный	= ЗначениеПоПолю("Внутренний");
	
	НовоеПредставление = ?(ПустаяСтрока(КодСтраны), "", "+" + КодСтраны)+ ?(ПустаяСтрока(КодГорода), "", "(" + КодГорода + ")") + ЗначениеПоПолю("НомерТелефона") + ?(ПустаяСтрока(Добавочный), "", "," + Добавочный); 	
		
	Возврат СокрЛП(НовоеПредставление);
	
КонецФункции

&НаКлиенте
Процедура ЗначенияПолейЗначениеПриИзменении(Элемент)
		
	Представление = СформироватьПредставление();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторСтроки = Параметры.ИдентификаторСтроки;
	ПодготовитьКонтактныеДанные();  
	
	Если НЕ ЗначенияПолей.Количество() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Представление 	= ВладелецФормы.КонтактнаяИнформация.НайтиПоИдентификатору(ИдентификаторСтроки).Представление;
    Комментарий		= ВладелецФормы.КонтактнаяИнформация.НайтиПоИдентификатору(ИдентификаторСтроки).Комментарий;
		
КонецПроцедуры
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	СохранитьДанные();
	Закрыть();
КонецПроцедуры
&НаКлиенте
Процедура Записать(Команда)
	СохранитьДанные();
КонецПроцедуры

&НаСервере
Процедура ПодготовитьКонтактныеДанные() Экспорт
	
	Объект	=  Параметры.Объект;
	Вид 	=  Параметры.Вид;
	Группа	=  Вид.Родитель;
	ID 		=  Параметры.ID;
	
	Запрос = Новый Запрос("	ВЫБРАТЬ
							|   &Объект             Объект,
							|   &ID                 ID,
							|   &Вид                Вид,
							|	Спр.Имя 			Поле,
							|	Спр.ПереводСтроки	ПереводСтроки,
							|	Спр.Вес				Вес,
							|	Спр.Имя.Сокращение 	Сокращение,
							|	ЕСТЬNULL(Рег.Значение, """") 		Значение
							|ИЗ 
							|	Справочник.ВидыКонтактнойИнформации.СоставПолей Спр
							|	ЛЕВОЕ СОЕДИНЕНИЕ
							|		(  ВЫБРАТЬ
							|				Поле,
							|				Значение
							|			ИЗ
							|				РегистрСведений.КонтактнаяИнформация
							|			ГДЕ
							|				Объект = &Объект И ID = &ID И Вид = &Вид 
							|		) Рег
							|	ПО
							|		Спр.Имя = Рег.Поле
							|ГДЕ
							|	Спр.Ссылка = &Вид");
							
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ID", 	ID);
	Запрос.УстановитьПараметр("Вид",	Вид);
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЗначенияПолей.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
	//Для Каждого Строка Из ЗначенияПолей ЦИкл
	//	Если НЕ ЗначениеЗаполнено(Строка.Значение) Тогда
	//		Строка.Значение = "";
	//	КонецЕсли;
	//КонецЦикла;
		
КонецПроцедуры
&НаСервере
Функция СохранитьЗначенияПолей()
	
	СоответствияЗначенийПолей = Новый Соответствие;
	Для Каждого Строка Из ЗначенияПолей Цикл
		СоответствияЗначенийПолей.Вставить(Строка.Поле, Строка.Значение);
	КонецЦикла;
	
	УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(Новый Структура("Объект, ID, Вид, Представление, Комментарий",Объект, ID, Вид, Представление, Комментарий), СоответствияЗначенийПолей);
				
	Возврат Истина;
		
КонецФункции
&НаКлиенте
Процедура СохранитьДанные()
	
	ВладелецФормы.КонтактнаяИнформация.НайтиПоИдентификатору(ИдентификаторСтроки).Представление = Представление;
	ВладелецФормы.КонтактнаяИнформация.НайтиПоИдентификатору(ИдентификаторСтроки).Комментарий 	= Комментарий;

	СохранитьЗначенияПолей();

КонецПроцедуры
